{
  "_name_or_path": "Crystalcareai/Yixtral-Test",
  "architectures": [
    "YixtralForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "Crystalcareai/Yixtral-Test--configuration_yixtral.YixtralConfig",
    "AutoModelForCausalLM": "Crystalcareai/Yixtral-Test--modeling_yixtral.YixtralForCausalLM"
  },
  "bos_token_id": 2,
  "eos_token_id": 1,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 262144,
  "model_type": "yixtral",
  "num_attention_heads": 32,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 48,
  "num_key_value_heads": 4,
  "num_local_experts": 8,
  "output_router_logits": false,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000000.0,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.2", 
  "use_cache": true,
  "vocab_size": 64000
}
